[{
        "id": "eternal-gaze",
        "title": "Eternal Gaze",
        "date": "03/08/2025",
        "thumbnail": "../images/works/games/eternal_gaze.png",
        "description": [
            "Game jam project"
        ],
        "link": "https://maximebastien.itch.io/eternal-gaze"
    },
    {
        "id": "radio-silence",
        "title": "Radio Silence",
        "date": "17/10/2024",
        "thumbnail": "../images/works/games/radio_silence.png",
        "description": [
            "In this project, I focused on developing gameplay mechanics and interactive elements for a survival-horror puzzle game where players explore a dark, mysterious environment, solve puzzles, and avoid a lurking monster. My role involved coding, while a friend from Howest created all the 3D assets."
        ],
        "key_research": [
            "Animations: Completed furniture animations and integrated sound effects for all interactive objects, enhancing immersion.",
            "Particle System: Implemented a dust particle system using a tutorial to amplify immersion in the abandoned house setting. Adjusted particles dynamically based on player actions—particles increase in size and speed when the player walks or runs, simulating dust clouds.",
            "Post-Processing: Applied post-processing profiles to heighten the eerie atmosphere.",
            "Sound Integration: Learned to sync audio with animations using animation events, allowing precise timing for multiple audio clips."
        ],
        "challenges": [
            "Dynamic Particle Adjustments: Initially, I hadn't planned for particle changes through code. By examining the PlayerScript, I modified the particles to react based on player movements, creating a more interactive environment.",
            "Sound Effects for Animations: Adding sound to animations proved challenging due to multiple audio clips. I resolved this by incorporating animation events and tracking object states with boolean logic, ensuring accurate audio playback."
        ],
        "results": "The combination of post-processing, particle effects, and sound design significantly enhances the game's immersion. This sprint deepened my understanding of integrating audio and particles into interactive elements.",
        "tools": [
            "Unity",
            "Particle System",
            "Animation Events",
            "Post-Processing",
            "C#"
        ],
        "link": "https://maximebastien.itch.io/journalist-horror-game"
    },
    {
        "id": "hope",
        "title": "HOPE",
        "date": "13/06/2025",
        "thumbnail": "../images/works/games/hope.jpg",
        "description": [
            "hope"
        ],
        "link": "https://maximebastien.itch.io/hope"
    },
    {
        "id": "magic-color-mix",
        "title": "Magic Color Mix",
        "date": "03/04/2025",
        "thumbnail": "../images/works/games/magic_color_mix.png",
        "description": [
            "Magic Color Mix"
        ],
        "link": "https://maximebastien.itch.io/magic-color-mix"
    },
    {
        "id": "counting-animals-with-snow-white",
        "title": "Counting Animals with Snow White",
        "date": "29/01/2025",
        "thumbnail": "../images/works/games/counting_animals_with_snow_white.png",
        "description": [
            "Counting Animals with Snow White"
        ],
        "link": "https://maximebastien.itch.io/counting-animals-with-snow-white"
    },
    {
        "id": "box-puzzle-game",
        "title": "Box Puzzle Game",
        "date": "20/05/2024",
        "thumbnail": "../images/works/games/box_puzzle_game.jpg",
        "description": [
            "This project is a puzzle-based game developed in Unity, designed as my final work for the 3D Games course. It features dynamic object interactions, allowing players to pick up, rotate, and manipulate objects to solve puzzles. Key gameplay elements include unlocking compartments, using animations and physics-based mechanics, and integrating audio for immersive feedback.",
            "This was my first experience developing a game in Unity, and it highlights my ability to implement complex gameplay mechanics and interactive environments."
        ],
        "link": "https://maximebastien.itch.io/box-puzzle-game"
    }
]